var city = [       
  {
    "name": "云南",
    "id": "530",
    "sub": [
      {
        "name": "昆明",
        "id": "5301",
        "sub": [
          {
            "name": "盘龙区",
            "id": "53011"
          },
          {
            "name": "五华区",
            "id": "53012"
          },
          {
            "name": "官渡区",
            "id": "53013"
          },
          {
            "name": "西山区",
            "id": "53014"
          }
        ]
      },
      {
        "name": "曲靖",
        "id": "5302",
        "sub": [
          {
            "name": "麒麟区",
            "id": "53021"
          },
          {
            "name": "宣威市",
            "id": "53022"
          },
          {
            "name": "马龙县",
            "id": "53023"
          }
        ]
      },
      {
        "name": "西双版纳傣族自治州",
        "id": "5303",
        "sub": [
          {
            "name": "景洪市",
            "id": "53031"
          },
          {
            "name": "勐海县",
            "id": "53032"
          },
          {
            "name": "勐腊县",
            "id": "53033"
          }
        ]
      }
    ]
  }
]
